Revit 2027 API
FaceArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual FaceArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As FaceArrayIterator
public:
virtual FaceArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> FaceArrayIterator
override ForwardIterator : unit -> FaceArrayIterator
Return Value
FaceArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace